firelab/TCLogger/src/tc_logger6.x/gps_pic24h.c
/*
 * File:   ad_pic24f.c
 * Author: cwold
 *
 * Created on February 9, 2016, 1:00 PM
 */

#include "p24hj128gp202.h"
#include "diskio.h"
#include "gps_pic24h.h"

// Debug
//#include "xprintf.h"
#include "uart_pic24h.h"

/* Socket controls  (Platform dependent) */
#define GPS_CS_LOW()  _LATB14 = 0	/* GPS CS = L */
#define GPS_CS_HIGH() _LATB14 = 1	/* GPS CS = H */
#define GPS_RESET_LOW() _LATA4 = 0
#define GPS_RESET_HIGH() _LATA4 = 1
#define GPS_ON_OFF() _LATB2
#define AD_CS_HIGH() _LATB12 = 1   /* AD CS = H */
#define RTCC_CS_HIGH()  _LATB1 = 1   /* RTCC CS = H */
#define RTCC_CS_LOW()   _LATB1 = 0  /* RTCC CS = L */

/* SPI2 bit rate controls */
#define	GPS_CLOCK() SPI2CON1 = 0x032B /* Set sclk2 to 6.67MHz with FCY of 40 MHz */

#define COMMS_WRITE (0B00000000) /* WRITE OPERATION */
#define COMMS_GPIO  (0B00000110) /* GPIO CONFIG. REGISTER */

typedef unsigned char bool;
#define true    1
#define false   0

static volatile
UINT Timer5;		/* 1000Hz decrement timer */
char _gps_rx_buff[1024];
const UINT _NUM_BYTES = 1024;
/* Definitions for MMC/SDC command */


#define MID129 {0xA0,0xA2,0x00,0x18,0x81,0x02,0x01,0x01,0x00,0x01,0x01,0x01,0x05,0x01,0x01,0x01,0x00,0x01, \
                0x00,0x01,0x00,0x00,0x00,0x01,0x00,0x00,0x12,0xC0,0x01,0x65,0xB0,0xB3}  //put in NMEA mode, 32 bytes

//#define MID117 {0x24,0x50,0x53,0x52,0x46,0x31,0x31,0x37,0x2C,0x31,0x30,0x2A,0x30,0x44,0x0D,0x0A} //orderly shutdown, 16 bytes
#define MID117 {0x24,0x50,0x53,0x52,0x46,0x31,0x31,0x37,0x2C,0x31,0x36,0x2A,0x30,0x42,0x0D,0x0A} //orderly shutdown, 16 bytes

#define MID125 {0x24,0x50,0x53,0x52,0x46,0x31,0x32,0x35,0x2A,0x32,0x31,0x0D,0x0A} //poll sofware version string, 13 bytes

#define MID103 {0x24,0x50,0x53,0x52,0x46,0x31,0x30,0x31,0x2C,0x30,0x32,0x2C,0x30,0x30, \
                0x2C,0x30,0x30,0x2C,0x30,0x31,0x2A,0x32,0x35,0x0D,0x0A} //MID103, GLL off, 25 bytes

#define GLL_OFF {0x24,0x50,0x53,0x52,0x46,0x31,0x30,0x31,0x2C,0x30,0x32,0x2C,0x30,0x30, \
                0x2C,0x30,0x30,0x2C,0x30,0x31,0x2A,0x32,0x35,0x0D,0x0A} //MID103, GLL off, 25 bytes

#define GSA_OFF {0x24,0x50,0x53,0x52,0x46,0x31,0x30,0x33,0x2C,0x30,0x32,0x2C,0x30,0x30, \
                0x2C,0x30,0x30,0x2C,0x30,0x31,0x2A,0x32,0x36,0x0D,0x0A} //MID103, GSA off, 25 bytes

#define GSA_ON {0x24,0x50,0x53,0x52,0x46,0x31,0x30,0x33,0x2C,0x30,0x32,0x2C,0x30,0x30, \
                0x2C,0x30,0x31,0x2C,0x30,0x31,0x2A,0x32,0x37,0x0D,0x0A} //MID103, GSA on, 25 bytes

#define GSV_OFF {0x24,0x50,0x53,0x52,0x46,0x31,0x30,0x33,0x2C,0x30,0x33,0x2C,0x30,0x30, \
                0x2C,0x30,0x30,0x2C,0x30,0x31,0x2A,0x32,0x37,0x0D,0x0A} //MID103, GSV off, 25 bytes

#define GSV_ON  {0x24,0x50,0x53,0x52,0x46,0x31,0x30,0x33,0x2C,0x30,0x33,0x2C,0x30,0x30, \
                0x2C,0x30,0x31,0x2C,0x30,0x31,0x2A,0x32,0x36,0x0D,0x0A} //MID103, GSV on, 25 bytes{

#define VTG_OFF {0x24,0x50,0x53,0x52,0x46,0x31,0x30,0x33,0x2C,0x30,0x35,0x2C,0x30,0x30, \
                0x2C,0x30,0x30,0x2C,0x30,0x31,0x2A,0x32,0x31,0x0D,0x0A} //MID103, VTG off, 25 bytes

#define ZDA_OFF {0x24,0x50,0x53,0x52,0x46,0x31,0x30,0x33,0x2C,0x30,0x38,0x2C,0x30,0x30, \
                0x2C,0x30,0x30,0x2C,0x30,0x31,0x2A,0x32,0x43,0x0D,0x0A} //MID103, ZDA off, 25 bytes

#define ZDA_ON {0x24,0x50,0x53,0x52,0x46,0x31,0x30,0x33,0x2C,0x30,0x38,0x2C,0x30,0x30, \
                0x2C,0x30,0x31,0x2C,0x30,0x31,0x2A,0x32,0x44,0x0D,0x0A} //MID103, ZDA on, 25 bytes

#define MID100 {0x24,0x50,0x53,0x52,0x46,0x31,0x30,0x30,0x2C,0x30,0x2C,0x31,0x31,0x35,0x32,0x30,0x30,0x2C, \
                0x38,0x2C,0x31,0x2C,0x30,0x2A,0x30,0x34,0x0D,0x0A}  //MID100, Switch to OSP Protocol, 28 bytes

#define ID132  {0xA0,0xA2,0x00,0x02,0x84,0x00,0x00,0x84,0xB0,0xB3} //ID132, Software version, 10 bytes

#define MID105 {0x24,0x50,0x53,0x52,0x46,0x31,0x30,0x35,0x2C,0x31,0x2A,0x33,0x46,0x0D,0x0A} //MID105, debug on, 15 bytes

#define SDI2    PORTBbits.RB10   /* RB10 INPUT */



/*****************************************************************************/
/* Local function prototypes */
/*****************************************************************************/
//static void get_zda_ut_date(const char* const gps_rx_buff, const UINT BUFFER_SIZE, const UINT nmea_start, BYTE* const ut_date);
static void get_zda_utc_time(const char* const gps_rx_buff, const UINT BUFFER_SIZE, const UINT nmea_start, BYTE* const utc_time);
static void get_rmc_utc_time(const char* const gps_rx_buff, const UINT BUFFER_SIZE, const UINT nmea_start, BYTE* const utc_time);
static void get_rmc_validity(const char* const gps_rx_buff, const UINT BUFFER_SIZE, const UINT nmea_start, BYTE* const gprmc_validity);
static void get_rmc_latitude(const char* const gps_rx_buff, const UINT BUFFER_SIZE, const UINT nmea_start, BYTE* const latitude);
static void get_rmc_north_or_south(const char* const gps_rx_buff, const UINT BUFFER_SIZE, const UINT nmea_start, BYTE* const north_or_south);
static void get_rmc_longitude(const char* const gps_rx_buff, const UINT BUFFER_SIZE, const UINT nmea_start, BYTE* const longitude);
static void get_rmc_east_or_west(const char* const gps_rx_buff, const UINT BUFFER_SIZE, const UINT nmea_start, BYTE* const east_or_west);
static void get_rmc_ut_date(const char* const gps_rx_buff, const UINT BUFFER_SIZE, const UINT nmea_start, BYTE* const ut_date);
static void get_gga_utc_time(const char* const gps_rx_buff, const UINT BUFFER_SIZE, const UINT nmea_start, BYTE* const utc_time);
static void get_gga_validity(const char* const gps_rx_buff, const UINT BUFFER_SIZE, const UINT nmea_start, BYTE* const fix_validity);
static void get_gga_latitude(const char* const gps_rx_buff, const UINT BUFFER_SIZE, const UINT nmea_start, BYTE* const latitude);
static void get_gga_north_or_south(const char* const gps_rx_buff, const UINT BUFFER_SIZE, const UINT nmea_start, BYTE* const north_or_south);
static void get_gga_longitude(const char* const gps_rx_buff, const UINT BUFFER_SIZE, const UINT nmea_start, BYTE* const longitude);
static void get_gga_east_or_west(const char* const gps_rx_buff, const UINT BUFFER_SIZE, const UINT nmea_start, BYTE* const east_or_west);
static void get_gga_satellites(const char* const gps_rx_buff, const UINT BUFFER_SIZE, const UINT nmea_start, BYTE* const satellites);
//static void get_gsv_satellites(const char* const gps_rx_buff, const UINT BUFFER_SIZE, const UINT nmea_start, BYTE* const satellites);
static int find_nmea_message(const char* const target_message_name, const char* const gps_rx_buff, const UINT BUFFER_SIZE, /*out*/ UINT* const nmea_start);
static int check_checksum(const char* const target_message_name, const char* const gps_rx_buff, const UINT BUFFER_SIZE, const UINT nmea_start, const UINT nmea_end);
static BYTE gps_xchg_spi (BYTE dat);

/*-----------------------------------------------------------------------*/
/* Select the gps                                                        */
/*-----------------------------------------------------------------------*/

static void gps_select (void)
{
    AD_CS_HIGH();   /* Make sure AD isn't selected */
    RTCC_CS_HIGH(); //deselect the rtcc
    GPS_CS_LOW();	/* Set CS# low */
;
    
