firelab/TCLogger/src/tc_logger6.x/gps_pic24h.c
}

static void gps_deselect (void)
{
    GPS_CS_HIGH(); /* set CS# high */
;
    
}



/*-----------------------------------------------------------------------*/
/* Transmit/Receive data to/from ad via SPI  (Platform dependent)       */
/*-----------------------------------------------------------------------*/

/* Single byte SPI transfer */

static BYTE gps_xchg_spi (BYTE dat)
{
//    gps_spi();
   	SPI2BUF = dat;
	while (!_SPIRBF_2);
	return (BYTE)SPI2BUF;
}


/*-----------------------------------------------------------------------*/
/* Deselect the a/d and release SPI bus                                  */
/*-----------------------------------------------------------------------*/


/* Block SPI transfers */

static void xmit_gps_multi (
	const char* gps_tx_buff,	/* Data to be sent */
	UINT cnt,  /* Number of bytes to send */
    BYTE* rxbuff,
    UINT rxcnt
)
{
    UINT i;
//    gps_spi();
    for(i = 0; i < cnt; i++)
    {
        SPI2BUF = *gps_tx_buff++;
        while (!_SPIRBF_2);
        *rxbuff++ = SPI2BUF;
        rxcnt += 1;
    }
}


//static void rcvr_gps_multi (
//	BYTE* rxbuff,		/* Buffer to store received data */
//	UINT cnt		/* Number of bytes to receive */
//)
//{
//    UINT i;
// 
//    for(i = 0; i < cnt; ++i)
//    {
//        SPI2BUF = 0xFF;
//        while (!_SPIRBF_2);
//        *rxbuff++ = SPI2BUF;
//    }
//   
//
//}

/*static void gps_toggle_deselect (void)
{
    GPS_CS_HIGH();
    gps_xchg_spi(0xFF);
    GPS_CS_LOW();
    
}*/

static void gps_spi (void)
{

    _SPIEN_2 = 0;
    GPS_CLOCK();	/* Enable SPI2 */
    SPI2CON2 = 0x0000;
    _SPIEN_2 = 1;
}

void gps_reset (void)
{
    GPS_RESET_LOW();
    Timer5 = 200;
    while(Timer5);
    GPS_RESET_HIGH();
}

static void gps_power_on (void)
{
	gps_reset();
    Timer5 = 50;
    while(Timer5);
    
    GPS_ON_OFF() = 1;
    Timer5 = 200;
    while(Timer5);
    GPS_ON_OFF() = 0;
    
    Timer5 = 50;
    while(Timer5);
    
   GPS_ON_OFF() = 1;
    Timer5 = 200;
    while(Timer5);
    GPS_ON_OFF() = 0;
        
}
//static void gps_power_off (void)
//{
////    GPS_ON_OFF() = 1;
////    Timer5 = 200;
////    while(Timer5);
////    GPS_ON_OFF() = 0;
//    
////     Timer5 = 50;
////    while(Timer5);
////    send_mid117();
////    Timer5 = 50;
////    while(Timer5);
////   GPS_ON_OFF() = 1;
////    Timer5 = 200;
////    while(Timer5);
////    GPS_ON_OFF() = 0;
//
//}

void gps_shutdown (void)
{
        
    gps_spi();
    gps_select();
    send_mid117();
    _LATB11 = 1;
    Timer5 = 2000;
    while(Timer5);
    _LATB11 = 0;
    gps_deselect();
    GPS_ON_OFF() = 1;
    Timer5 = 200;
    while(Timer5);
    GPS_ON_OFF() = 0;
    
    
}

void gps_fill_buffer(char* gps_rx_buff, UINT num_bytes)
{
    UINT i = 0;

    gps_spi();
    gps_select();

    while(i < num_bytes)
    {
        Timer5 = 1;
        while(Timer5){;}
        gps_rx_buff[i] = gps_xchg_spi(0xA7);
               i++;
             gps_rx_buff[i] = gps_xchg_spi(0xB4);
    
            i++;
   
    }
        
    gps_deselect();
  
    
}

/*-----------------------------------------------------------------*/
/* initialize the GPS                                              */
/*-----------------------------------------------------------------*/

void gps_init(void)
{
   
    
    gps_power_on();
    Timer5 = 1000;
    while(Timer5){;}

    
}
/*-------------------------------------------------------------------*/
/*                      */
/*-------------------------------------------------------------------*/
void send_mid129 (void)
{
    const BYTE buff[] = MID129;
    BYTE rxbuff[32];
    UINT rxcnt;
    rxcnt = 0;
    
    gps_spi();
    gps_select();
    xmit_gps_multi(buff,32,rxbuff,rxcnt);
    gps_deselect(); 
}
/*-------------------------------------------------------------------*/
/*                      */
/*-------------------------------------------------------------------*/
void send_mid103 (void)
{
    const BYTE buff[] = MID103;
    BYTE rxbuff[25];
    UINT rxcnt;
    rxcnt = 0;
    gps_spi();
    gps_select();
    xmit_gps_multi(buff,25,rxbuff,rxcnt);
    gps_deselect(); 
}
/*----------------------------------------------------------------------*/
/*                                                                      */
/*----------------------------------------------------------------------*/
void send_mid125 (void)
{
    const BYTE buff[] = MID125;
    BYTE rxbuff[13];
    UINT rxcnt;
    rxcnt = 0;
    gps_spi();
    gps_select();
    xmit_gps_multi(buff,13,rxbuff,rxcnt);
    gps_deselect();
    
}
/*----------------------------------------------------------------------*/
/*                                                                      */
/*----------------------------------------------------------------------*/
void send_mid117 (void)
{
    const BYTE buff[] = MID117;
    BYTE rxbuff[16];
    UINT rxcnt;
    rxcnt = 0;
    gps_spi();
    gps_select();
    xmit_gps_multi(buff,16,rxbuff,rxcnt);
    gps_deselect(); 
}
/*----------------------------------------------------------------------*/
/*                                                                      */
/*----------------------------------------------------------------------*/
void send_mid100 (void)
{
    const BYTE buff[] = MID100;
    BYTE rxbuff[28];
    UINT rxcnt;
    rxcnt = 0;
    gps_spi();
    gps_select();
    xmit_gps_multi(buff,28,rxbuff,rxcnt);
    gps_deselect(); 
}
/*----------------------------------------------------------------------*/
/*                                                                      */
/*----------------------------------------------------------------------*/
void send_mid105 (void)
{
    const BYTE buff[] = MID105;
    BYTE rxbuff[15];
    UINT rxcnt;
    rxcnt = 0;
    gps_spi();
    gps_select();
    xmit_gps_multi(buff,15,rxbuff,rxcnt);
    gps_deselect(); 
}
/*----------------------------------------------------------------------*/
/*                                                                      */
/*----------------------------------------------------------------------*/
void send_id132 (void)
{
    const BYTE buff[] = ID132;
    BYTE rxbuff[10];
    UINT rxcnt;
    rxcnt = 0;
    gps_spi();
    gps_select();
    xmit_gps_multi(buff,10,rxbuff,rxcnt);
    gps_deselect(); 
}
/*----------------------------------------------------------------------*/
/*                                                                      */
/*----------------------------------------------------------------------*/
void send_gsv_off (void)
{
    const BYTE buff[] = GSV_OFF;
    BYTE rxbuff[25];
    UINT rxcnt;
    rxcnt = 0;
    gps_spi();
    gps_select();
    xmit_gps_multi(buff,25,rxbuff,rxcnt);
    gps_deselect(); 
}
/*----------------------------------------------------------------------*/
/*                                                                      */
/*----------------------------------------------------------------------*/
void send_gsv_on (void)
{
    const BYTE buff[] = GSV_ON;
    BYTE rxbuff[25];
    UINT rxcnt;
    rxcnt = 0;
    gps_spi();
    gps_select();
    xmit_gps_multi(buff,25,rxbuff,rxcnt);
    gps_deselect(); 
}
/*----------------------------------------------------------------------*/
/*                                                                      */
/*----------------------------------------------------------------------*/

