firelab/TCLogger/src/tc_logger6.x/gps_pic24h.c
void send_gsa_off (void)
{
    const BYTE buff[] = GSA_OFF;
    BYTE rxbuff[25];
    UINT rxcnt;
    rxcnt = 0;
    gps_spi();
    gps_select();
    xmit_gps_multi(buff,25,rxbuff,rxcnt);
    gps_deselect(); 
}
/*----------------------------------------------------------------------*/
/*                                                                      */
/*----------------------------------------------------------------------*/

void send_gsa_on (void)
{
    const BYTE buff[] = GSA_ON;
    BYTE rxbuff[25];
    UINT rxcnt;
    rxcnt = 0;
    gps_spi();
    gps_select();
    xmit_gps_multi(buff,25,rxbuff,rxcnt);
    gps_deselect(); 
}
/*----------------------------------------------------------------------*/
/*                                                                      */
/*----------------------------------------------------------------------*/

void send_zda_on (void)
{
    const BYTE buff[] = ZDA_ON;
    BYTE rxbuff[25];
    UINT rxcnt;
    rxcnt = 0;
    gps_spi();
    gps_select();
    xmit_gps_multi(buff,25,rxbuff,rxcnt);
    gps_deselect(); 
}
/*----------------------------------------------------------------------*/
/*                                                                      */
/*----------------------------------------------------------------------*/

DWORD  get_gps(void)
{  
    DWORD arg = 0;
    gps_select();
    gps_deselect();
    return arg;
}


/*-----------------------------------------------------------------------*/
/* Device Timer Driven Procedure                                         */
/*-----------------------------------------------------------------------*/
/* This function must be called by timer interrupt in period of 1ms      */

void gps_timerproc (void)
{
	/*BYTE s;*/
	UINT n;
	n = Timer5;					/* 1000Hz decrement timer with zero stopped */
	if (n) Timer5 = --n;
}

// find_nmea_message returns 0 on success, 1 on failure
void gps_parse_zda(
    const char* const gps_rx_buff,
    const UINT BUFFER_SIZE, 
    BYTE* const utc_time)

{
    char target_message_name[6];

    UINT nmea_start = 0;
    bool is_zda_found = false;
    gps_spi();
    // GPZDA is the target message
    target_message_name[0] = 'G';
    target_message_name[1] = 'P';
    target_message_name[2] = 'Z';
    target_message_name[3] = 'D';
    target_message_name[4] = 'A';
    target_message_name[5] = '\0';

    // Find GPZDA message in the buffer
    is_zda_found = find_nmea_message(target_message_name, gps_rx_buff, BUFFER_SIZE, &nmea_start);

    if (is_zda_found)
    {
        // Parse the GPRMC message for needed data
        get_zda_utc_time(gps_rx_buff, BUFFER_SIZE, nmea_start, utc_time);

    }
}

/*******************************************************************************/
void gps_parse_rmc(
    const char* const gps_rx_buff,
    const UINT BUFFER_SIZE, 
    BYTE* const utc_time,
    BYTE* const gprmc_validity,
    BYTE* const latitude,
    BYTE* const north_or_south,
    BYTE* const longitude,
    BYTE* const east_or_west,
    BYTE* const ut_date)
{
    char target_message_name[6];

    UINT nmea_start = 0;
    bool is_rmc_found = false;
    gps_spi();
    // GPRMC is the target message
    target_message_name[0] = 'G';
    target_message_name[1] = 'P';
    target_message_name[2] = 'R';
    target_message_name[3] = 'M';
    target_message_name[4] = 'C';
    target_message_name[5] = '\0';

    // Find GPRMC message in the buffer
    is_rmc_found = find_nmea_message(target_message_name, gps_rx_buff, BUFFER_SIZE, &nmea_start);

    if (is_rmc_found)
    {
        // Parse the GPRMC message for needed data
        get_rmc_utc_time(gps_rx_buff, BUFFER_SIZE, nmea_start, utc_time);
        get_rmc_validity(gps_rx_buff, BUFFER_SIZE, nmea_start, gprmc_validity);
        if (gprmc_validity[0] == 0x41) //  0x41 or ASCII 'A' means valid data
        {
            get_rmc_latitude(gps_rx_buff, BUFFER_SIZE, nmea_start, latitude);
            get_rmc_north_or_south(gps_rx_buff, BUFFER_SIZE, nmea_start, north_or_south);
            get_rmc_longitude(gps_rx_buff, BUFFER_SIZE, nmea_start, longitude);
            get_rmc_east_or_west(gps_rx_buff, BUFFER_SIZE, nmea_start, east_or_west);
        }
        get_rmc_ut_date(gps_rx_buff, BUFFER_SIZE, nmea_start, ut_date);
    }
}
// find_nmea_message returns 0 on success, 1 on failure
//void gps_parse_gsv(
//    const BYTE* const gps_rx_buff,
//    const UINT BUFFER_SIZE, 
//    BYTE* const satellites)
//{
//    char target_message_name[6];
//
//    UINT nmea_start = 0;
//    bool is_gsv_found = false;
//    gps_spi();
//    // GPRMC is the target message
//    target_message_name[0] = 'G';
//    target_message_name[1] = 'P';
//    target_message_name[2] = 'G';
//    target_message_name[3] = 'S';
//    target_message_name[4] = 'V';
//    target_message_name[5] = '\0';
//
//    // Find GPRMC message in the buffer
//    is_gsv_found = find_nmea_message(target_message_name, gps_rx_buff, BUFFER_SIZE, &nmea_start);
//
//    if (is_gsv_found)
//    {
//        // Parse the GPRMC message for needed data
//        get_gsv_satellites(gps_rx_buff, BUFFER_SIZE, nmea_start, satellites);
//    }
//}
// find_nmea_message returns 0 on success, 1 on failure
void gps_parse_gga(
    const char* const gps_rx_buff,
    const UINT BUFFER_SIZE, 
    BYTE* const utc_time,
    BYTE* const latitude,
    BYTE* const north_or_south,
    BYTE* const longitude,
    BYTE* const east_or_west,
    BYTE* const fix_validity,    
    BYTE* const satellites)
{
    char target_message_name[6];

    UINT nmea_start = 0;
    bool is_gga_found = false;
    gps_spi();
    // GPRMC is the target message
    target_message_name[0] = 'G';
    target_message_name[1] = 'P';
    target_message_name[2] = 'G';
    target_message_name[3] = 'G';
    target_message_name[4] = 'A';
    target_message_name[5] = '\0';

    // Find NMEA message in the buffer
    is_gga_found = find_nmea_message(target_message_name, gps_rx_buff, BUFFER_SIZE, &nmea_start);

    if (is_gga_found)
    {
        // Parse the NMEA message for needed data
        
