firelab/TCLogger/src/tc_logger6.x/gps_pic24h.c
        get_gga_utc_time(gps_rx_buff, BUFFER_SIZE, nmea_start, utc_time);
        get_gga_latitude(gps_rx_buff, BUFFER_SIZE, nmea_start, latitude);
        get_gga_north_or_south(gps_rx_buff, BUFFER_SIZE, nmea_start, north_or_south);
        get_gga_longitude(gps_rx_buff, BUFFER_SIZE, nmea_start, longitude);
        get_gga_east_or_west(gps_rx_buff, BUFFER_SIZE, nmea_start, east_or_west);
        get_gga_validity(gps_rx_buff, BUFFER_SIZE, nmea_start, fix_validity);
        get_gga_satellites(gps_rx_buff, BUFFER_SIZE, nmea_start, satellites);
        
       
    }
}
// find_nmea_message /* 0:Failed, 1:Successful */


static int find_nmea_message(
    const char* const target_message_name,
    const char* const gps_rx_buff,
    const UINT BUFFER_SIZE, 
    /*out*/ UINT* const nmea_start)
{
    //xdev_in(uart_getc);		/* Join UART and console */
    //xdev_out(uart_putc);

    bool is_end_of_target_found = false;
    bool is_message_received = false;
    bool is_target_message_received = false;
    bool is_valid_checksum = false;

    UINT i = BUFFER_SIZE;
  
    UINT local_nmea_end = 0;
    UINT local_nmea_start = 0;
 
    *nmea_start = 0;

    // Find target message in the buffer
    while (!is_target_message_received && (i > 0))
    {
        is_message_received = false;
        is_end_of_target_found = false;
        local_nmea_start = 0;
        local_nmea_end = 0;

        // Find the message start symbol
        while (!is_message_received && (i > 0))
        {
            if (gps_rx_buff[i] == 0x24)
            {
                local_nmea_start = i;
                is_message_received = true;
            }
            i--;
        }
        if (is_message_received)
        {
//            xprintf("NMEA message received!\n");
        }

        // Check for target message
        if ((local_nmea_start + 5) < BUFFER_SIZE)
        {
            if (gps_rx_buff[local_nmea_start + 1] == target_message_name[0] &&
                gps_rx_buff[local_nmea_start + 2] == target_message_name[1] &&
                gps_rx_buff[local_nmea_start + 3] == target_message_name[2] &&
                gps_rx_buff[local_nmea_start + 4] == target_message_name[3] &&
                gps_rx_buff[local_nmea_start + 5] == target_message_name[4])
            {
                is_target_message_received = true;
            }
            else
            {
                is_target_message_received = false;
            }
        }

        // Find end of target message
        if (is_target_message_received)
        {
//            xprintf("%s message received!\n", target_message_name);
//            xprintf("%s message start index is %u\n", target_message_name, local_nmea_start);
            // Find end of message
            i = local_nmea_start;
            while ((!is_end_of_target_found) && (i < BUFFER_SIZE))
            {
                if (gps_rx_buff[i] == 0x0A)
                {
                    local_nmea_end = i;
                    if (local_nmea_end > 4) // 
                    {
 //                       xprintf("%s message end index is %u\n", target_message_name, local_nmea_end);
                        is_end_of_target_found = true;
                    }
                }
                i++;
            }
        }

        // Check the checksum
        if (is_end_of_target_found)
        {
            is_valid_checksum = check_checksum(target_message_name, gps_rx_buff, BUFFER_SIZE, local_nmea_start, local_nmea_end);
        }
    }
    if (is_valid_checksum)
    {
        *nmea_start = local_nmea_start; // store the start index of the nmea message
        return 1;
    }
    else
    {
        return 0;
    }
}


static void get_rmc_utc_time(const char* const gps_rx_buff, const UINT BUFFER_SIZE, const UINT nmea_start, BYTE* const utc_time)
{
    // Locate and store GPRMC time data, found after first comma
    UINT comma_count = 0;
    UINT i = nmea_start;
    UINT time_start = 0;
    UINT time_end = 0;
    while ((comma_count < 1) && (i < BUFFER_SIZE))
    {
        if (gps_rx_buff[i] == 0x2C)
        {
            i++;
            comma_count++;
        }
        else
        {
            i++;
        }
    }
    time_start = i;
    while ((gps_rx_buff[i] != 0x2C) && (i < BUFFER_SIZE))
    {
        i++;
    }
    time_end = i;

    for (i = time_start; i < time_end; i++)
    {
        if ((i - time_start) < 10)
        {
            utc_time[i - time_start] = gps_rx_buff[i];
        }
    }
}

static void get_rmc_validity(
    const char* const gps_rx_buff,
    const UINT BUFFER_SIZE, 
    const UINT nmea_start,
    BYTE* const gprmc_validity)
{
    // Locate and GPRMC validity indicator, found after second comma
    UINT comma_count = 0;
    UINT i = nmea_start;

    while ((comma_count < 2) && (i < BUFFER_SIZE))
    {
        if (gps_rx_buff[i] == 0x2C)
        {
            i++;
            comma_count++;
        }
        else
        {
            i++;
        }
    }
    // GPS fix validity indicator is in 1st byte after stored comma location
    gprmc_validity[0] = gps_rx_buff[i];
}

static void get_rmc_latitude(
    const char* const gps_rx_buff,
    const UINT BUFFER_SIZE,
    const UINT nmea_start,
    BYTE* const latitude)
{
    // Locate and store GPRMC latitude data, found after third comma
    UINT comma_count = 0;
    UINT i = nmea_start;
    UINT latitude_start = 0;
    UINT latitude_end = 0;
    while ((comma_count < 3) && (i < BUFFER_SIZE))
    {
        if (gps_rx_buff[i] == 0x2C)
        {
            i++;
            comma_count++;
        }
        else
        {
            i++;
        }
    }
    latitude_start = i;
    while ((gps_rx_buff[i] != 0x2C) && (i < BUFFER_SIZE))
    {
        i++;
    }
    latitude_end = i;

    for (i = latitude_start; i < latitude_end; i++)
    {
        if ((i - latitude_start) < 16)
        {
            latitude[i - latitude_start] = gps_rx_buff[i];
        }
    }
}

static void get_rmc_north_or_south(
    const char* const gps_rx_buff, 
    const UINT BUFFER_SIZE, 
    const UINT nmea_start,
    BYTE* const north_or_south)
{
    // Locate and store GPRMC North or South data, found after forth comma
    UINT comma_count = 0;
    UINT i = nmea_start;

    while ((comma_count < 4) && (i < BUFFER_SIZE))
    {
        if (gps_rx_buff[i] == 0x2C)
        {
            i++;
            comma_count++;
        }
        else
        {
            i++;
        }
    }
    north_or_south[0] = gps_rx_buff[i];
}

static void get_rmc_longitude(
    const char* const gps_rx_buff,
    const UINT BUFFER_SIZE,
    const UINT nmea_start,
    BYTE* const longitude)
{
    // Locate and store GPRMC lognitude data, found after fifth comma
    UINT comma_count = 0;
    UINT i = nmea_start;
    UINT longitude_start = 0;
    UINT longitude_end = 0;
    while ((comma_count < 5) && (i < BUFFER_SIZE))
    {
        if (gps_rx_buff[i] == 0x2C)
        {
            i++;
            comma_count++;
        }
        else
        {
            i++;
        }
    }
    longitude_start = i;
    while ((gps_rx_buff[i] != 0x2C) && (i < BUFFER_SIZE))
    {
        i++;
    }
    longitude_end = i;

