firelab/TCLogger/src/tc_logger6.x/gps_pic24h.c
    for (i = longitude_start; i < longitude_end; i++)
    {
        if ((i - longitude_start) < 16)
        {
            longitude[i - longitude_start] = gps_rx_buff[i];
        }
    }
}

static void get_rmc_east_or_west(
    const char* const gps_rx_buff, 
    const UINT BUFFER_SIZE, 
    const UINT nmea_start,
    BYTE* const east_or_west)
{
    // Locate and store GPRMC North or South data, found after sixth comma
    UINT comma_count = 0;
    UINT i = nmea_start;

    while ((comma_count < 6) && (i < BUFFER_SIZE))
    {
        if (gps_rx_buff[i] == 0x2C)
        {
            i++;
            comma_count++;
        }
        else
        {
            i++;
        }
    }
    east_or_west[0] = gps_rx_buff[i];
}

static void get_rmc_ut_date(
    const char* const gps_rx_buff, 
    const UINT BUFFER_SIZE, 
    const UINT nmea_start,
    BYTE* const ut_date)
{
    // Locate and store GPRMC ut date data, found after ninth comma
    UINT comma_count = 0;
    UINT i = nmea_start;
    UINT date_start = 0;
    UINT date_end = 0;

    while ((comma_count < 9) && (i < BUFFER_SIZE))
    {
        if (gps_rx_buff[i] == 0x2C)
        {
            i++;
            comma_count++;
        }
        else
        {
            i++;
        }
    }
    date_start = i;
    date_end = date_start + 6;

    for (i = date_start; i < date_end; i++)
    {
        ut_date[i - date_start] = gps_rx_buff[i];
    }
}

static void get_gga_utc_time(const char* const gps_rx_buff, const UINT BUFFER_SIZE, const UINT nmea_start, BYTE* const utc_time)
{
    // Locate and store GPRMC time data, found after first comma
    UINT comma_count = 0;
    UINT i = nmea_start;
    UINT time_start = 0;
    UINT time_end = 0;
    while ((comma_count < 1) && (i < BUFFER_SIZE))
    {
        if (gps_rx_buff[i] == 0x2C)
        {
            i++;
            comma_count++;
        }
        else
        {
            i++;
        }
    }
    time_start = i;
    while ((gps_rx_buff[i] != 0x2C) && (i < BUFFER_SIZE))
    {
        i++;
    }
    time_end = i;

    for (i = time_start; i < time_end; i++)
    {
        if ((i - time_start) < 10)
        {
            utc_time[i - time_start] = gps_rx_buff[i];
        }
    }
}


static void get_gga_latitude(
    const char* const gps_rx_buff,
    const UINT BUFFER_SIZE,
    const UINT nmea_start,
    BYTE* const latitude)
{
    // Locate and store GPRMC latitude data, found after third comma
    UINT comma_count = 0;
    UINT i = nmea_start;
    UINT latitude_start = 0;
    UINT latitude_end = 0;
    while ((comma_count < 2) && (i < BUFFER_SIZE))
    {
        if (gps_rx_buff[i] == 0x2C)
        {
            i++;
            comma_count++;
        }
        else
        {
            i++;
        }
    }
    latitude_start = i;
    while ((gps_rx_buff[i] != 0x2C) && (i < BUFFER_SIZE))
    {
        i++;
    }
    latitude_end = i;

    for (i = latitude_start; i < latitude_end; i++)
    {
        if ((i - latitude_start) < 16)
        {
            latitude[i - latitude_start] = gps_rx_buff[i];
        }
    }
}

static void get_gga_north_or_south(
    const char* const gps_rx_buff, 
    const UINT BUFFER_SIZE, 
    const UINT nmea_start,
    BYTE* const north_or_south)
{
    // Locate and store GPRMC North or South data, found after forth comma
    UINT comma_count = 0;
    UINT i = nmea_start;

    while ((comma_count < 3) && (i < BUFFER_SIZE))
    {
        if (gps_rx_buff[i] == 0x2C)
        {
            i++;
            comma_count++;
        }
        else
        {
            i++;
        }
    }
    north_or_south[0] = gps_rx_buff[i];
}

static void get_gga_longitude(
    const char* const gps_rx_buff,
    const UINT BUFFER_SIZE,
    const UINT nmea_start,
    BYTE* const longitude)
{
    // Locate and store GPRMC longitude data, found after fifth comma
    UINT comma_count = 0;
    UINT i = nmea_start;
    UINT longitude_start = 0;
    UINT longitude_end = 0;
    while ((comma_count < 4) && (i < BUFFER_SIZE))
    {
        if (gps_rx_buff[i] == 0x2C)
        {
            i++;
            comma_count++;
        }
        else
        {
            i++;
        }
    }
    longitude_start = i;
    while ((gps_rx_buff[i] != 0x2C) && (i < BUFFER_SIZE))
    {
        i++;
    }
    longitude_end = i;

    for (i = longitude_start; i < longitude_end; i++)
    {
        if ((i - longitude_start) < 16)
        {
            longitude[i - longitude_start] = gps_rx_buff[i];
        }
    }
}

static void get_gga_east_or_west(
    const char* const gps_rx_buff, 
    const UINT BUFFER_SIZE, 
    const UINT nmea_start,
    BYTE* const east_or_west)
{
    // Locate and store GPRMC North or South data, found after sixth comma
    UINT comma_count = 0;
    UINT i = nmea_start;

    while ((comma_count < 5) && (i < BUFFER_SIZE))
    {
        if (gps_rx_buff[i] == 0x2C)
        {
            i++;
            comma_count++;
        }
        else
        {
            i++;
        }
    }
    east_or_west[0] = gps_rx_buff[i];
}
static void get_gga_validity(
    const char* const gps_rx_buff,
    const UINT BUFFER_SIZE, 
    const UINT nmea_start,
    BYTE* const fix_validity)
{
    // Locate and GPRMC validity indicator, found after second comma
    UINT comma_count = 0;
    UINT i = nmea_start;

    while ((comma_count < 6) && (i < BUFFER_SIZE))
    {
        if (gps_rx_buff[i] == 0x2C)
        {
            i++;
            comma_count++;
        }
        else
        {
            i++;
        }
    }
    // GPS fix validity indicator is in 1st byte after stored comma location
    fix_validity[0] = gps_rx_buff[i];
}
//static void get_msg_satellites(
//    const char* const gps_rx_buff,
//    const UINT BUFFER_SIZE, 
//    const UINT nmea_start,
//    BYTE* const satellites)
//{
//    // Locate and GPRMC validity indicator, found after second comma
//    UINT comma_count = 0;
//    UINT i = nmea_start;
//
//    while ((comma_count < 7) && (i < BUFFER_SIZE))
//    {
//        if (gps_rx_buff[i] == 0x2C)
//        {
//            i++;
//            comma_count++;
//        }
//        else
//        {
//            i++;
//        }
//    }
//    // GPS fix validity indicator is in 1st byte after stored comma location
//    satellites[0] = gps_rx_buff[i];
//}

static void get_gga_satellites(
    const char* const gps_rx_buff,
    const UINT BUFFER_SIZE,
    const UINT nmea_start,
    BYTE* const satellites)
{
    // Locate and store GPGGA satellite data, found after sixth comma
    UINT comma_count = 0;
    UINT i = nmea_start;
    UINT satellites_start = 0;
    UINT satellites_end = 0;
    while ((comma_count < 7) && (i < BUFFER_SIZE))
    {
        if (gps_rx_buff[i] == 0x2C)
        {
            i++;
            comma_count++;
        }
        else
        {
            i++;
        }
    }
    satellites_start = i;
    while ((gps_rx_buff[i] != 0x2C) && (i < BUFFER_SIZE))
    {
        i++;
    }
    satellites_end = i;

    for (i = satellites_start; i < satellites_end; i++)
    {
        if ((i - satellites_start) < 3)
        {
            satellites[i - satellites_start] = gps_rx_buff[i];
        }
    }
}

//static void get_gsv_satellites(
//    const char* const gps_rx_buff,
//    const UINT BUFFER_SIZE,
//    const UINT nmea_start,
//    BYTE* const satellites)
//{
//    UINT comma_count = 0;
//    UINT i = nmea_start;
//    UINT satellites_start = 0;
//    UINT satellites_end = 0;
//    while ((comma_count < 3) && (i < BUFFER_SIZE))
//    {
//        if (gps_rx_buff[i] == 0x2C)
//        {
//            i++;
//            comma_count++;
//        }
//        else
//        {
//            i++;
//        }
//    }
//    satellites_start = i;
//    while ((gps_rx_buff[i] != 0x2C) && (i < BUFFER_SIZE))
//    {
//        i++;
//    }
//    satellites_end = i;
//
//    for (i = satellites_start; i < satellites_end; i++)
//    {
//        if ((i - satellites_start) < 3)
//        {
//            satellites[i - satellites_start] = gps_rx_buff[i];
//        }
//    }
//}

