firelab/TCLogger/src/tc_logger6.x/gps_pic24h.c
static void get_zda_utc_time(const char* const gps_rx_buff, const UINT BUFFER_SIZE, const UINT nmea_start, BYTE* const utc_time)
{
    // Locate and store GPZDZ time data, found after first comma
    UINT comma_count = 0;
    UINT i = nmea_start;
    UINT time_start = 0;
    UINT time_end = 0;
    while ((comma_count < 1) && (i < BUFFER_SIZE))
    {
        if (gps_rx_buff[i] == 0x2C)
        {
            i++;
            comma_count++;
        }
        else
        {
            i++;
        }
    }
    time_start = i;
    while ((gps_rx_buff[i] != 0x2C) && (i < BUFFER_SIZE))
    {
        i++;
    }
    time_end = i;

    for (i = time_start; i < time_end; i++)
    {
        if ((i - time_start) < 10)
        {
            utc_time[i - time_start] = gps_rx_buff[i];
        }
    }
}

//static void get_zda_ut_date(
//    const char* const gps_rx_buff, 
//    const UINT BUFFER_SIZE, 
//    const UINT nmea_start,
//    BYTE* const ut_date)
//{
//    // Locate and store GPZDA ut date data, found after 2nd comma
//    UINT comma_count = 0;
//    UINT i = nmea_start;
//    UINT date_start = 0;
//    UINT date_end = 0;
//
//    while ((comma_count < 2) && (i < BUFFER_SIZE))
//    {
//        if (gps_rx_buff[i] == 0x2C)
//        {
//            i++;
//            comma_count++;
//        }
//        else
//        {
//            i++;
//        }
//    }
//    date_start = i;
//    date_end = date_start + 6;
//
//    for (i = date_start; i < date_end; i++)
//    {
//        ut_date[i - date_start] = gps_rx_buff[i];
//    }
//}

static int check_checksum(
    const char* const target_message_name, 
    const char* const gps_rx_buff, 
    const UINT BUFFER_SIZE, 
    const UINT nmea_start, 
    const UINT nmea_end)
{
    //xdev_in(uart_getc);		/* Join UART and console */
    //xdev_out(uart_putc);

    bool is_valid_checksum = false;

    BYTE nmea_checksum[2];

    char checksum_string[5];
    char* temp_char_ptr;

    long converted_received_checksum = 0;

    UINT computed_checksum = 0;
    UINT nmea_checksummed_end = 0;
    UINT nmea_checksummed_start = 0;
    UINT i = 0;

    // Locate and store checksum
    if (nmea_end > 4) // 
    {
        nmea_checksum[0] = gps_rx_buff[nmea_end - 3];
        nmea_checksum[1] = gps_rx_buff[nmea_end - 2];

        // Locate the checksummed message
        nmea_checksummed_start = nmea_start + 1;
        nmea_checksummed_end = nmea_end - 5;
    }

    // Compute the checksum
    computed_checksum = 0;
    for (i = nmea_checksummed_start; i <= nmea_checksummed_end; i++)
    {
        computed_checksum ^= gps_rx_buff[i];
    }

    checksum_string[0] = '0';
    checksum_string[1] = 'x';
    checksum_string[2] = nmea_checksum[0];
    checksum_string[3] = nmea_checksum[1];
    checksum_string[4] = '\0';

    temp_char_ptr = checksum_string;
    xatoi((const char**)&temp_char_ptr, &converted_received_checksum);

//    xprintf("Received %s checksum is %c%c\n", target_message_name, nmea_checksum[0], nmea_checksum[1]);
//    xprintf("Computed %s checksum is %X\n", target_message_name, computed_checksum);

    if (converted_received_checksum == computed_checksum)
    {
//        xprintf("%s checksum is valid!\n", target_message_name);
        is_valid_checksum = true;
    }
    else
    {
 //       xprintf("ERROR: %s checksum is invalid!\n", target_message_name);
    }

    return is_valid_checksum;
}
